Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pio.h
/* -------- PIO_FRLHSR : (PIO Offset: 0xD8) ( R/ 32) Fall/Rise - Low/High Status Register -------- */
#define PIO_FRLHSR_P0_Pos                     _U_(0)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P0_Msk                     (_U_(0x1) << PIO_FRLHSR_P0_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P0(value)                  (PIO_FRLHSR_P0_Msk & ((value) << PIO_FRLHSR_P0_Pos))
#define PIO_FRLHSR_P1_Pos                     _U_(1)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P1_Msk                     (_U_(0x1) << PIO_FRLHSR_P1_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P1(value)                  (PIO_FRLHSR_P1_Msk & ((value) << PIO_FRLHSR_P1_Pos))
#define PIO_FRLHSR_P2_Pos                     _U_(2)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P2_Msk                     (_U_(0x1) << PIO_FRLHSR_P2_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P2(value)                  (PIO_FRLHSR_P2_Msk & ((value) << PIO_FRLHSR_P2_Pos))
#define PIO_FRLHSR_P3_Pos                     _U_(3)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P3_Msk                     (_U_(0x1) << PIO_FRLHSR_P3_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P3(value)                  (PIO_FRLHSR_P3_Msk & ((value) << PIO_FRLHSR_P3_Pos))
#define PIO_FRLHSR_P4_Pos                     _U_(4)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P4_Msk                     (_U_(0x1) << PIO_FRLHSR_P4_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P4(value)                  (PIO_FRLHSR_P4_Msk & ((value) << PIO_FRLHSR_P4_Pos))
#define PIO_FRLHSR_P5_Pos                     _U_(5)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P5_Msk                     (_U_(0x1) << PIO_FRLHSR_P5_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P5(value)                  (PIO_FRLHSR_P5_Msk & ((value) << PIO_FRLHSR_P5_Pos))
#define PIO_FRLHSR_P6_Pos                     _U_(6)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P6_Msk                     (_U_(0x1) << PIO_FRLHSR_P6_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P6(value)                  (PIO_FRLHSR_P6_Msk & ((value) << PIO_FRLHSR_P6_Pos))
#define PIO_FRLHSR_P7_Pos                     _U_(7)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P7_Msk                     (_U_(0x1) << PIO_FRLHSR_P7_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P7(value)                  (PIO_FRLHSR_P7_Msk & ((value) << PIO_FRLHSR_P7_Pos))
#define PIO_FRLHSR_P8_Pos                     _U_(8)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P8_Msk                     (_U_(0x1) << PIO_FRLHSR_P8_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P8(value)                  (PIO_FRLHSR_P8_Msk & ((value) << PIO_FRLHSR_P8_Pos))
#define PIO_FRLHSR_P9_Pos                     _U_(9)                                               /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P9_Msk                     (_U_(0x1) << PIO_FRLHSR_P9_Pos)                      /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P9(value)                  (PIO_FRLHSR_P9_Msk & ((value) << PIO_FRLHSR_P9_Pos))
#define PIO_FRLHSR_P10_Pos                    _U_(10)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P10_Msk                    (_U_(0x1) << PIO_FRLHSR_P10_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P10(value)                 (PIO_FRLHSR_P10_Msk & ((value) << PIO_FRLHSR_P10_Pos))
#define PIO_FRLHSR_P11_Pos                    _U_(11)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P11_Msk                    (_U_(0x1) << PIO_FRLHSR_P11_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P11(value)                 (PIO_FRLHSR_P11_Msk & ((value) << PIO_FRLHSR_P11_Pos))
#define PIO_FRLHSR_P12_Pos                    _U_(12)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P12_Msk                    (_U_(0x1) << PIO_FRLHSR_P12_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P12(value)                 (PIO_FRLHSR_P12_Msk & ((value) << PIO_FRLHSR_P12_Pos))
#define PIO_FRLHSR_P13_Pos                    _U_(13)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P13_Msk                    (_U_(0x1) << PIO_FRLHSR_P13_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P13(value)                 (PIO_FRLHSR_P13_Msk & ((value) << PIO_FRLHSR_P13_Pos))
#define PIO_FRLHSR_P14_Pos                    _U_(14)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P14_Msk                    (_U_(0x1) << PIO_FRLHSR_P14_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P14(value)                 (PIO_FRLHSR_P14_Msk & ((value) << PIO_FRLHSR_P14_Pos))
#define PIO_FRLHSR_P15_Pos                    _U_(15)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P15_Msk                    (_U_(0x1) << PIO_FRLHSR_P15_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P15(value)                 (PIO_FRLHSR_P15_Msk & ((value) << PIO_FRLHSR_P15_Pos))
#define PIO_FRLHSR_P16_Pos                    _U_(16)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P16_Msk                    (_U_(0x1) << PIO_FRLHSR_P16_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P16(value)                 (PIO_FRLHSR_P16_Msk & ((value) << PIO_FRLHSR_P16_Pos))
#define PIO_FRLHSR_P17_Pos                    _U_(17)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P17_Msk                    (_U_(0x1) << PIO_FRLHSR_P17_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P17(value)                 (PIO_FRLHSR_P17_Msk & ((value) << PIO_FRLHSR_P17_Pos))
#define PIO_FRLHSR_P18_Pos                    _U_(18)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P18_Msk                    (_U_(0x1) << PIO_FRLHSR_P18_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P18(value)                 (PIO_FRLHSR_P18_Msk & ((value) << PIO_FRLHSR_P18_Pos))
#define PIO_FRLHSR_P19_Pos                    _U_(19)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P19_Msk                    (_U_(0x1) << PIO_FRLHSR_P19_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P19(value)                 (PIO_FRLHSR_P19_Msk & ((value) << PIO_FRLHSR_P19_Pos))
#define PIO_FRLHSR_P20_Pos                    _U_(20)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P20_Msk                    (_U_(0x1) << PIO_FRLHSR_P20_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P20(value)                 (PIO_FRLHSR_P20_Msk & ((value) << PIO_FRLHSR_P20_Pos))
#define PIO_FRLHSR_P21_Pos                    _U_(21)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P21_Msk                    (_U_(0x1) << PIO_FRLHSR_P21_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P21(value)                 (PIO_FRLHSR_P21_Msk & ((value) << PIO_FRLHSR_P21_Pos))
#define PIO_FRLHSR_P22_Pos                    _U_(22)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P22_Msk                    (_U_(0x1) << PIO_FRLHSR_P22_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P22(value)                 (PIO_FRLHSR_P22_Msk & ((value) << PIO_FRLHSR_P22_Pos))
#define PIO_FRLHSR_P23_Pos                    _U_(23)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P23_Msk                    (_U_(0x1) << PIO_FRLHSR_P23_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P23(value)                 (PIO_FRLHSR_P23_Msk & ((value) << PIO_FRLHSR_P23_Pos))
#define PIO_FRLHSR_P24_Pos                    _U_(24)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P24_Msk                    (_U_(0x1) << PIO_FRLHSR_P24_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P24(value)                 (PIO_FRLHSR_P24_Msk & ((value) << PIO_FRLHSR_P24_Pos))
#define PIO_FRLHSR_P25_Pos                    _U_(25)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P25_Msk                    (_U_(0x1) << PIO_FRLHSR_P25_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P25(value)                 (PIO_FRLHSR_P25_Msk & ((value) << PIO_FRLHSR_P25_Pos))
#define PIO_FRLHSR_P26_Pos                    _U_(26)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P26_Msk                    (_U_(0x1) << PIO_FRLHSR_P26_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P26(value)                 (PIO_FRLHSR_P26_Msk & ((value) << PIO_FRLHSR_P26_Pos))
#define PIO_FRLHSR_P27_Pos                    _U_(27)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P27_Msk                    (_U_(0x1) << PIO_FRLHSR_P27_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P27(value)                 (PIO_FRLHSR_P27_Msk & ((value) << PIO_FRLHSR_P27_Pos))
#define PIO_FRLHSR_P28_Pos                    _U_(28)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P28_Msk                    (_U_(0x1) << PIO_FRLHSR_P28_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P28(value)                 (PIO_FRLHSR_P28_Msk & ((value) << PIO_FRLHSR_P28_Pos))
#define PIO_FRLHSR_P29_Pos                    _U_(29)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P29_Msk                    (_U_(0x1) << PIO_FRLHSR_P29_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P29(value)                 (PIO_FRLHSR_P29_Msk & ((value) << PIO_FRLHSR_P29_Pos))
#define PIO_FRLHSR_P30_Pos                    _U_(30)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P30_Msk                    (_U_(0x1) << PIO_FRLHSR_P30_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P30(value)                 (PIO_FRLHSR_P30_Msk & ((value) << PIO_FRLHSR_P30_Pos))
#define PIO_FRLHSR_P31_Pos                    _U_(31)                                              /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PIO_FRLHSR_P31_Msk                    (_U_(0x1) << PIO_FRLHSR_P31_Pos)                     /**< (PIO_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PIO_FRLHSR_P31(value)                 (PIO_FRLHSR_P31_Msk & ((value) << PIO_FRLHSR_P31_Pos))
#define PIO_FRLHSR_Msk                        _U_(0xFFFFFFFF)                                      /**< (PIO_FRLHSR) Register Mask  */

#define PIO_FRLHSR_P_Pos                      _U_(0)                                               /**< (PIO_FRLHSR Position) Edge/Level Interrupt Source Selection */
#define PIO_FRLHSR_P_Msk                      (_U_(0xFFFFFFFF) << PIO_FRLHSR_P_Pos)                /**< (PIO_FRLHSR Mask) P */
#define PIO_FRLHSR_P(value)                   (PIO_FRLHSR_P_Msk & ((value) << PIO_FRLHSR_P_Pos))   

/* -------- PIO_WPMR : (PIO Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define PIO_WPMR_WPEN_Pos                     _U_(0)                                               /**< (PIO_WPMR) Write Protection Enable Position */
#define PIO_WPMR_WPEN_Msk                     (_U_(0x1) << PIO_WPMR_WPEN_Pos)                      /**< (PIO_WPMR) Write Protection Enable Mask */
#define PIO_WPMR_WPEN(value)                  (PIO_WPMR_WPEN_Msk & ((value) << PIO_WPMR_WPEN_Pos))
#define PIO_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (PIO_WPMR) Write Protection Key Position */
#define PIO_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << PIO_WPMR_WPKEY_Pos)                /**< (PIO_WPMR) Write Protection Key Mask */
#define PIO_WPMR_WPKEY(value)                 (PIO_WPMR_WPKEY_Msk & ((value) << PIO_WPMR_WPKEY_Pos))
#define   PIO_WPMR_WPKEY_PASSWD_Val           _U_(0x50494F)                                        /**< (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define PIO_WPMR_WPKEY_PASSWD                 (PIO_WPMR_WPKEY_PASSWD_Val << PIO_WPMR_WPKEY_Pos)    /**< (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define PIO_WPMR_Msk                          _U_(0xFFFFFF01)                                      /**< (PIO_WPMR) Register Mask  */


