Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pio.h
/* -------- PIO_SLEWR : (PIO Offset: 0x110) (R/W 32) I/O Slewrate Control Register -------- */
#define PIO_SLEWR_SR0_Pos                     _U_(0)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 0 Position */
#define PIO_SLEWR_SR0_Msk                     (_U_(0x1) << PIO_SLEWR_SR0_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 0 Mask */
#define PIO_SLEWR_SR0(value)                  (PIO_SLEWR_SR0_Msk & ((value) << PIO_SLEWR_SR0_Pos))
#define   PIO_SLEWR_SR0_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR0_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR0_DISABLED                (PIO_SLEWR_SR0_DISABLED_Val << PIO_SLEWR_SR0_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR0_ENABLED                 (PIO_SLEWR_SR0_ENABLED_Val << PIO_SLEWR_SR0_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR1_Pos                     _U_(1)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 1 Position */
#define PIO_SLEWR_SR1_Msk                     (_U_(0x1) << PIO_SLEWR_SR1_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 1 Mask */
#define PIO_SLEWR_SR1(value)                  (PIO_SLEWR_SR1_Msk & ((value) << PIO_SLEWR_SR1_Pos))
#define   PIO_SLEWR_SR1_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR1_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR1_DISABLED                (PIO_SLEWR_SR1_DISABLED_Val << PIO_SLEWR_SR1_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR1_ENABLED                 (PIO_SLEWR_SR1_ENABLED_Val << PIO_SLEWR_SR1_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR2_Pos                     _U_(2)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 2 Position */
#define PIO_SLEWR_SR2_Msk                     (_U_(0x1) << PIO_SLEWR_SR2_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 2 Mask */
#define PIO_SLEWR_SR2(value)                  (PIO_SLEWR_SR2_Msk & ((value) << PIO_SLEWR_SR2_Pos))
#define   PIO_SLEWR_SR2_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR2_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR2_DISABLED                (PIO_SLEWR_SR2_DISABLED_Val << PIO_SLEWR_SR2_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR2_ENABLED                 (PIO_SLEWR_SR2_ENABLED_Val << PIO_SLEWR_SR2_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR3_Pos                     _U_(3)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 3 Position */
#define PIO_SLEWR_SR3_Msk                     (_U_(0x1) << PIO_SLEWR_SR3_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 3 Mask */
#define PIO_SLEWR_SR3(value)                  (PIO_SLEWR_SR3_Msk & ((value) << PIO_SLEWR_SR3_Pos))
#define   PIO_SLEWR_SR3_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR3_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR3_DISABLED                (PIO_SLEWR_SR3_DISABLED_Val << PIO_SLEWR_SR3_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR3_ENABLED                 (PIO_SLEWR_SR3_ENABLED_Val << PIO_SLEWR_SR3_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR4_Pos                     _U_(4)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 4 Position */
#define PIO_SLEWR_SR4_Msk                     (_U_(0x1) << PIO_SLEWR_SR4_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 4 Mask */
#define PIO_SLEWR_SR4(value)                  (PIO_SLEWR_SR4_Msk & ((value) << PIO_SLEWR_SR4_Pos))
#define   PIO_SLEWR_SR4_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR4_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR4_DISABLED                (PIO_SLEWR_SR4_DISABLED_Val << PIO_SLEWR_SR4_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR4_ENABLED                 (PIO_SLEWR_SR4_ENABLED_Val << PIO_SLEWR_SR4_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR5_Pos                     _U_(5)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 5 Position */
#define PIO_SLEWR_SR5_Msk                     (_U_(0x1) << PIO_SLEWR_SR5_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 5 Mask */
#define PIO_SLEWR_SR5(value)                  (PIO_SLEWR_SR5_Msk & ((value) << PIO_SLEWR_SR5_Pos))
#define   PIO_SLEWR_SR5_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR5_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR5_DISABLED                (PIO_SLEWR_SR5_DISABLED_Val << PIO_SLEWR_SR5_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR5_ENABLED                 (PIO_SLEWR_SR5_ENABLED_Val << PIO_SLEWR_SR5_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR6_Pos                     _U_(6)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 6 Position */
#define PIO_SLEWR_SR6_Msk                     (_U_(0x1) << PIO_SLEWR_SR6_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 6 Mask */
#define PIO_SLEWR_SR6(value)                  (PIO_SLEWR_SR6_Msk & ((value) << PIO_SLEWR_SR6_Pos))
#define   PIO_SLEWR_SR6_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR6_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR6_DISABLED                (PIO_SLEWR_SR6_DISABLED_Val << PIO_SLEWR_SR6_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR6_ENABLED                 (PIO_SLEWR_SR6_ENABLED_Val << PIO_SLEWR_SR6_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR7_Pos                     _U_(7)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 7 Position */
#define PIO_SLEWR_SR7_Msk                     (_U_(0x1) << PIO_SLEWR_SR7_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 7 Mask */
#define PIO_SLEWR_SR7(value)                  (PIO_SLEWR_SR7_Msk & ((value) << PIO_SLEWR_SR7_Pos))
#define   PIO_SLEWR_SR7_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR7_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR7_DISABLED                (PIO_SLEWR_SR7_DISABLED_Val << PIO_SLEWR_SR7_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR7_ENABLED                 (PIO_SLEWR_SR7_ENABLED_Val << PIO_SLEWR_SR7_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR8_Pos                     _U_(8)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 8 Position */
#define PIO_SLEWR_SR8_Msk                     (_U_(0x1) << PIO_SLEWR_SR8_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 8 Mask */
#define PIO_SLEWR_SR8(value)                  (PIO_SLEWR_SR8_Msk & ((value) << PIO_SLEWR_SR8_Pos))
#define   PIO_SLEWR_SR8_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR8_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR8_DISABLED                (PIO_SLEWR_SR8_DISABLED_Val << PIO_SLEWR_SR8_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR8_ENABLED                 (PIO_SLEWR_SR8_ENABLED_Val << PIO_SLEWR_SR8_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR9_Pos                     _U_(9)                                               /**< (PIO_SLEWR) Slewrate Control for IO line 9 Position */
#define PIO_SLEWR_SR9_Msk                     (_U_(0x1) << PIO_SLEWR_SR9_Pos)                      /**< (PIO_SLEWR) Slewrate Control for IO line 9 Mask */
#define PIO_SLEWR_SR9(value)                  (PIO_SLEWR_SR9_Msk & ((value) << PIO_SLEWR_SR9_Pos))
#define   PIO_SLEWR_SR9_DISABLED_Val          _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR9_ENABLED_Val           _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR9_DISABLED                (PIO_SLEWR_SR9_DISABLED_Val << PIO_SLEWR_SR9_Pos)    /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR9_ENABLED                 (PIO_SLEWR_SR9_ENABLED_Val << PIO_SLEWR_SR9_Pos)     /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR10_Pos                    _U_(10)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 10 Position */
#define PIO_SLEWR_SR10_Msk                    (_U_(0x1) << PIO_SLEWR_SR10_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 10 Mask */
#define PIO_SLEWR_SR10(value)                 (PIO_SLEWR_SR10_Msk & ((value) << PIO_SLEWR_SR10_Pos))
#define   PIO_SLEWR_SR10_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR10_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR10_DISABLED               (PIO_SLEWR_SR10_DISABLED_Val << PIO_SLEWR_SR10_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR10_ENABLED                (PIO_SLEWR_SR10_ENABLED_Val << PIO_SLEWR_SR10_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR11_Pos                    _U_(11)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 11 Position */
#define PIO_SLEWR_SR11_Msk                    (_U_(0x1) << PIO_SLEWR_SR11_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 11 Mask */
#define PIO_SLEWR_SR11(value)                 (PIO_SLEWR_SR11_Msk & ((value) << PIO_SLEWR_SR11_Pos))
#define   PIO_SLEWR_SR11_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR11_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR11_DISABLED               (PIO_SLEWR_SR11_DISABLED_Val << PIO_SLEWR_SR11_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR11_ENABLED                (PIO_SLEWR_SR11_ENABLED_Val << PIO_SLEWR_SR11_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR12_Pos                    _U_(12)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 12 Position */
#define PIO_SLEWR_SR12_Msk                    (_U_(0x1) << PIO_SLEWR_SR12_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 12 Mask */
#define PIO_SLEWR_SR12(value)                 (PIO_SLEWR_SR12_Msk & ((value) << PIO_SLEWR_SR12_Pos))
#define   PIO_SLEWR_SR12_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR12_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR12_DISABLED               (PIO_SLEWR_SR12_DISABLED_Val << PIO_SLEWR_SR12_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR12_ENABLED                (PIO_SLEWR_SR12_ENABLED_Val << PIO_SLEWR_SR12_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR13_Pos                    _U_(13)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 13 Position */
#define PIO_SLEWR_SR13_Msk                    (_U_(0x1) << PIO_SLEWR_SR13_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 13 Mask */
#define PIO_SLEWR_SR13(value)                 (PIO_SLEWR_SR13_Msk & ((value) << PIO_SLEWR_SR13_Pos))
#define   PIO_SLEWR_SR13_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR13_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR13_DISABLED               (PIO_SLEWR_SR13_DISABLED_Val << PIO_SLEWR_SR13_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR13_ENABLED                (PIO_SLEWR_SR13_ENABLED_Val << PIO_SLEWR_SR13_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR14_Pos                    _U_(14)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 14 Position */
#define PIO_SLEWR_SR14_Msk                    (_U_(0x1) << PIO_SLEWR_SR14_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 14 Mask */
#define PIO_SLEWR_SR14(value)                 (PIO_SLEWR_SR14_Msk & ((value) << PIO_SLEWR_SR14_Pos))
#define   PIO_SLEWR_SR14_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR14_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR14_DISABLED               (PIO_SLEWR_SR14_DISABLED_Val << PIO_SLEWR_SR14_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR14_ENABLED                (PIO_SLEWR_SR14_ENABLED_Val << PIO_SLEWR_SR14_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR15_Pos                    _U_(15)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 15 Position */
#define PIO_SLEWR_SR15_Msk                    (_U_(0x1) << PIO_SLEWR_SR15_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 15 Mask */
#define PIO_SLEWR_SR15(value)                 (PIO_SLEWR_SR15_Msk & ((value) << PIO_SLEWR_SR15_Pos))
#define   PIO_SLEWR_SR15_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR15_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR15_DISABLED               (PIO_SLEWR_SR15_DISABLED_Val << PIO_SLEWR_SR15_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR15_ENABLED                (PIO_SLEWR_SR15_ENABLED_Val << PIO_SLEWR_SR15_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR16_Pos                    _U_(16)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 16 Position */
#define PIO_SLEWR_SR16_Msk                    (_U_(0x1) << PIO_SLEWR_SR16_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 16 Mask */
#define PIO_SLEWR_SR16(value)                 (PIO_SLEWR_SR16_Msk & ((value) << PIO_SLEWR_SR16_Pos))
#define   PIO_SLEWR_SR16_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR16_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR16_DISABLED               (PIO_SLEWR_SR16_DISABLED_Val << PIO_SLEWR_SR16_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR16_ENABLED                (PIO_SLEWR_SR16_ENABLED_Val << PIO_SLEWR_SR16_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR17_Pos                    _U_(17)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 17 Position */
#define PIO_SLEWR_SR17_Msk                    (_U_(0x1) << PIO_SLEWR_SR17_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 17 Mask */
#define PIO_SLEWR_SR17(value)                 (PIO_SLEWR_SR17_Msk & ((value) << PIO_SLEWR_SR17_Pos))
#define   PIO_SLEWR_SR17_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR17_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR17_DISABLED               (PIO_SLEWR_SR17_DISABLED_Val << PIO_SLEWR_SR17_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR17_ENABLED                (PIO_SLEWR_SR17_ENABLED_Val << PIO_SLEWR_SR17_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR18_Pos                    _U_(18)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 18 Position */
#define PIO_SLEWR_SR18_Msk                    (_U_(0x1) << PIO_SLEWR_SR18_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 18 Mask */
#define PIO_SLEWR_SR18(value)                 (PIO_SLEWR_SR18_Msk & ((value) << PIO_SLEWR_SR18_Pos))
#define   PIO_SLEWR_SR18_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR18_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR18_DISABLED               (PIO_SLEWR_SR18_DISABLED_Val << PIO_SLEWR_SR18_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR18_ENABLED                (PIO_SLEWR_SR18_ENABLED_Val << PIO_SLEWR_SR18_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR19_Pos                    _U_(19)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 19 Position */
#define PIO_SLEWR_SR19_Msk                    (_U_(0x1) << PIO_SLEWR_SR19_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 19 Mask */
#define PIO_SLEWR_SR19(value)                 (PIO_SLEWR_SR19_Msk & ((value) << PIO_SLEWR_SR19_Pos))
#define   PIO_SLEWR_SR19_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR19_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR19_DISABLED               (PIO_SLEWR_SR19_DISABLED_Val << PIO_SLEWR_SR19_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR19_ENABLED                (PIO_SLEWR_SR19_ENABLED_Val << PIO_SLEWR_SR19_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR20_Pos                    _U_(20)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 20 Position */
#define PIO_SLEWR_SR20_Msk                    (_U_(0x1) << PIO_SLEWR_SR20_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 20 Mask */
#define PIO_SLEWR_SR20(value)                 (PIO_SLEWR_SR20_Msk & ((value) << PIO_SLEWR_SR20_Pos))
#define   PIO_SLEWR_SR20_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR20_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR20_DISABLED               (PIO_SLEWR_SR20_DISABLED_Val << PIO_SLEWR_SR20_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR20_ENABLED                (PIO_SLEWR_SR20_ENABLED_Val << PIO_SLEWR_SR20_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR21_Pos                    _U_(21)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 21 Position */
#define PIO_SLEWR_SR21_Msk                    (_U_(0x1) << PIO_SLEWR_SR21_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 21 Mask */
#define PIO_SLEWR_SR21(value)                 (PIO_SLEWR_SR21_Msk & ((value) << PIO_SLEWR_SR21_Pos))
#define   PIO_SLEWR_SR21_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR21_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR21_DISABLED               (PIO_SLEWR_SR21_DISABLED_Val << PIO_SLEWR_SR21_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR21_ENABLED                (PIO_SLEWR_SR21_ENABLED_Val << PIO_SLEWR_SR21_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR22_Pos                    _U_(22)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 22 Position */
#define PIO_SLEWR_SR22_Msk                    (_U_(0x1) << PIO_SLEWR_SR22_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 22 Mask */
#define PIO_SLEWR_SR22(value)                 (PIO_SLEWR_SR22_Msk & ((value) << PIO_SLEWR_SR22_Pos))
#define   PIO_SLEWR_SR22_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR22_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR22_DISABLED               (PIO_SLEWR_SR22_DISABLED_Val << PIO_SLEWR_SR22_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR22_ENABLED                (PIO_SLEWR_SR22_ENABLED_Val << PIO_SLEWR_SR22_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR23_Pos                    _U_(23)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 23 Position */
#define PIO_SLEWR_SR23_Msk                    (_U_(0x1) << PIO_SLEWR_SR23_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 23 Mask */
#define PIO_SLEWR_SR23(value)                 (PIO_SLEWR_SR23_Msk & ((value) << PIO_SLEWR_SR23_Pos))
#define   PIO_SLEWR_SR23_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR23_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
