Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pio.h
#define PIO_SLEWR_SR23_DISABLED               (PIO_SLEWR_SR23_DISABLED_Val << PIO_SLEWR_SR23_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR23_ENABLED                (PIO_SLEWR_SR23_ENABLED_Val << PIO_SLEWR_SR23_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR24_Pos                    _U_(24)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 24 Position */
#define PIO_SLEWR_SR24_Msk                    (_U_(0x1) << PIO_SLEWR_SR24_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 24 Mask */
#define PIO_SLEWR_SR24(value)                 (PIO_SLEWR_SR24_Msk & ((value) << PIO_SLEWR_SR24_Pos))
#define   PIO_SLEWR_SR24_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR24_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR24_DISABLED               (PIO_SLEWR_SR24_DISABLED_Val << PIO_SLEWR_SR24_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR24_ENABLED                (PIO_SLEWR_SR24_ENABLED_Val << PIO_SLEWR_SR24_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR25_Pos                    _U_(25)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 25 Position */
#define PIO_SLEWR_SR25_Msk                    (_U_(0x1) << PIO_SLEWR_SR25_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 25 Mask */
#define PIO_SLEWR_SR25(value)                 (PIO_SLEWR_SR25_Msk & ((value) << PIO_SLEWR_SR25_Pos))
#define   PIO_SLEWR_SR25_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR25_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR25_DISABLED               (PIO_SLEWR_SR25_DISABLED_Val << PIO_SLEWR_SR25_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR25_ENABLED                (PIO_SLEWR_SR25_ENABLED_Val << PIO_SLEWR_SR25_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR26_Pos                    _U_(26)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 26 Position */
#define PIO_SLEWR_SR26_Msk                    (_U_(0x1) << PIO_SLEWR_SR26_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 26 Mask */
#define PIO_SLEWR_SR26(value)                 (PIO_SLEWR_SR26_Msk & ((value) << PIO_SLEWR_SR26_Pos))
#define   PIO_SLEWR_SR26_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR26_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR26_DISABLED               (PIO_SLEWR_SR26_DISABLED_Val << PIO_SLEWR_SR26_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR26_ENABLED                (PIO_SLEWR_SR26_ENABLED_Val << PIO_SLEWR_SR26_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR27_Pos                    _U_(27)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 27 Position */
#define PIO_SLEWR_SR27_Msk                    (_U_(0x1) << PIO_SLEWR_SR27_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 27 Mask */
#define PIO_SLEWR_SR27(value)                 (PIO_SLEWR_SR27_Msk & ((value) << PIO_SLEWR_SR27_Pos))
#define   PIO_SLEWR_SR27_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR27_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR27_DISABLED               (PIO_SLEWR_SR27_DISABLED_Val << PIO_SLEWR_SR27_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR27_ENABLED                (PIO_SLEWR_SR27_ENABLED_Val << PIO_SLEWR_SR27_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR28_Pos                    _U_(28)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 28 Position */
#define PIO_SLEWR_SR28_Msk                    (_U_(0x1) << PIO_SLEWR_SR28_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 28 Mask */
#define PIO_SLEWR_SR28(value)                 (PIO_SLEWR_SR28_Msk & ((value) << PIO_SLEWR_SR28_Pos))
#define   PIO_SLEWR_SR28_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR28_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR28_DISABLED               (PIO_SLEWR_SR28_DISABLED_Val << PIO_SLEWR_SR28_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR28_ENABLED                (PIO_SLEWR_SR28_ENABLED_Val << PIO_SLEWR_SR28_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR29_Pos                    _U_(29)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 29 Position */
#define PIO_SLEWR_SR29_Msk                    (_U_(0x1) << PIO_SLEWR_SR29_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 29 Mask */
#define PIO_SLEWR_SR29(value)                 (PIO_SLEWR_SR29_Msk & ((value) << PIO_SLEWR_SR29_Pos))
#define   PIO_SLEWR_SR29_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR29_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR29_DISABLED               (PIO_SLEWR_SR29_DISABLED_Val << PIO_SLEWR_SR29_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR29_ENABLED                (PIO_SLEWR_SR29_ENABLED_Val << PIO_SLEWR_SR29_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR30_Pos                    _U_(30)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 30 Position */
#define PIO_SLEWR_SR30_Msk                    (_U_(0x1) << PIO_SLEWR_SR30_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 30 Mask */
#define PIO_SLEWR_SR30(value)                 (PIO_SLEWR_SR30_Msk & ((value) << PIO_SLEWR_SR30_Pos))
#define   PIO_SLEWR_SR30_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR30_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR30_DISABLED               (PIO_SLEWR_SR30_DISABLED_Val << PIO_SLEWR_SR30_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR30_ENABLED                (PIO_SLEWR_SR30_ENABLED_Val << PIO_SLEWR_SR30_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_SR31_Pos                    _U_(31)                                              /**< (PIO_SLEWR) Slewrate Control for IO line 31 Position */
#define PIO_SLEWR_SR31_Msk                    (_U_(0x1) << PIO_SLEWR_SR31_Pos)                     /**< (PIO_SLEWR) Slewrate Control for IO line 31 Mask */
#define PIO_SLEWR_SR31(value)                 (PIO_SLEWR_SR31_Msk & ((value) << PIO_SLEWR_SR31_Pos))
#define   PIO_SLEWR_SR31_DISABLED_Val         _U_(0x0)                                             /**< (PIO_SLEWR) No slewrate control.  */
#define   PIO_SLEWR_SR31_ENABLED_Val          _U_(0x1)                                             /**< (PIO_SLEWR) Slewrate controlled.  */
#define PIO_SLEWR_SR31_DISABLED               (PIO_SLEWR_SR31_DISABLED_Val << PIO_SLEWR_SR31_Pos)  /**< (PIO_SLEWR) No slewrate control. Position  */
#define PIO_SLEWR_SR31_ENABLED                (PIO_SLEWR_SR31_ENABLED_Val << PIO_SLEWR_SR31_Pos)   /**< (PIO_SLEWR) Slewrate controlled. Position  */
#define PIO_SLEWR_Msk                         _U_(0xFFFFFFFF)                                      /**< (PIO_SLEWR) Register Mask  */

#define PIO_SLEWR_SR_Pos                      _U_(0)                                               /**< (PIO_SLEWR Position) Slewrate Control for IO line 3x */
#define PIO_SLEWR_SR_Msk                      (_U_(0xFFFFFFFF) << PIO_SLEWR_SR_Pos)                /**< (PIO_SLEWR Mask) SR */
#define PIO_SLEWR_SR(value)                   (PIO_SLEWR_SR_Msk & ((value) << PIO_SLEWR_SR_Pos))   

