Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pio.h
/* -------- PIO_DRIVER : (PIO Offset: 0x118) (R/W 32) I/O Drive Register -------- */
#define PIO_DRIVER_DR0_Pos                    _U_(0)                                               /**< (PIO_DRIVER) Drive of I/O Line 0 Position */
#define PIO_DRIVER_DR0_Msk                    (_U_(0x1) << PIO_DRIVER_DR0_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 0 Mask */
#define PIO_DRIVER_DR0(value)                 (PIO_DRIVER_DR0_Msk & ((value) << PIO_DRIVER_DR0_Pos))
#define   PIO_DRIVER_DR0_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR0_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR0_LOW                    (PIO_DRIVER_DR0_LOW_Val << PIO_DRIVER_DR0_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR0_HIGH                   (PIO_DRIVER_DR0_HIGH_Val << PIO_DRIVER_DR0_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR1_Pos                    _U_(1)                                               /**< (PIO_DRIVER) Drive of I/O Line 1 Position */
#define PIO_DRIVER_DR1_Msk                    (_U_(0x1) << PIO_DRIVER_DR1_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 1 Mask */
#define PIO_DRIVER_DR1(value)                 (PIO_DRIVER_DR1_Msk & ((value) << PIO_DRIVER_DR1_Pos))
#define   PIO_DRIVER_DR1_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR1_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR1_LOW                    (PIO_DRIVER_DR1_LOW_Val << PIO_DRIVER_DR1_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR1_HIGH                   (PIO_DRIVER_DR1_HIGH_Val << PIO_DRIVER_DR1_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR2_Pos                    _U_(2)                                               /**< (PIO_DRIVER) Drive of I/O Line 2 Position */
#define PIO_DRIVER_DR2_Msk                    (_U_(0x1) << PIO_DRIVER_DR2_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 2 Mask */
#define PIO_DRIVER_DR2(value)                 (PIO_DRIVER_DR2_Msk & ((value) << PIO_DRIVER_DR2_Pos))
#define   PIO_DRIVER_DR2_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR2_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR2_LOW                    (PIO_DRIVER_DR2_LOW_Val << PIO_DRIVER_DR2_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR2_HIGH                   (PIO_DRIVER_DR2_HIGH_Val << PIO_DRIVER_DR2_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR3_Pos                    _U_(3)                                               /**< (PIO_DRIVER) Drive of I/O Line 3 Position */
#define PIO_DRIVER_DR3_Msk                    (_U_(0x1) << PIO_DRIVER_DR3_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 3 Mask */
#define PIO_DRIVER_DR3(value)                 (PIO_DRIVER_DR3_Msk & ((value) << PIO_DRIVER_DR3_Pos))
#define   PIO_DRIVER_DR3_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR3_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR3_LOW                    (PIO_DRIVER_DR3_LOW_Val << PIO_DRIVER_DR3_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR3_HIGH                   (PIO_DRIVER_DR3_HIGH_Val << PIO_DRIVER_DR3_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR4_Pos                    _U_(4)                                               /**< (PIO_DRIVER) Drive of I/O Line 4 Position */
#define PIO_DRIVER_DR4_Msk                    (_U_(0x1) << PIO_DRIVER_DR4_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 4 Mask */
#define PIO_DRIVER_DR4(value)                 (PIO_DRIVER_DR4_Msk & ((value) << PIO_DRIVER_DR4_Pos))
#define   PIO_DRIVER_DR4_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR4_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR4_LOW                    (PIO_DRIVER_DR4_LOW_Val << PIO_DRIVER_DR4_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR4_HIGH                   (PIO_DRIVER_DR4_HIGH_Val << PIO_DRIVER_DR4_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR5_Pos                    _U_(5)                                               /**< (PIO_DRIVER) Drive of I/O Line 5 Position */
#define PIO_DRIVER_DR5_Msk                    (_U_(0x1) << PIO_DRIVER_DR5_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 5 Mask */
#define PIO_DRIVER_DR5(value)                 (PIO_DRIVER_DR5_Msk & ((value) << PIO_DRIVER_DR5_Pos))
#define   PIO_DRIVER_DR5_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR5_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR5_LOW                    (PIO_DRIVER_DR5_LOW_Val << PIO_DRIVER_DR5_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR5_HIGH                   (PIO_DRIVER_DR5_HIGH_Val << PIO_DRIVER_DR5_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR6_Pos                    _U_(6)                                               /**< (PIO_DRIVER) Drive of I/O Line 6 Position */
#define PIO_DRIVER_DR6_Msk                    (_U_(0x1) << PIO_DRIVER_DR6_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 6 Mask */
#define PIO_DRIVER_DR6(value)                 (PIO_DRIVER_DR6_Msk & ((value) << PIO_DRIVER_DR6_Pos))
#define   PIO_DRIVER_DR6_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR6_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR6_LOW                    (PIO_DRIVER_DR6_LOW_Val << PIO_DRIVER_DR6_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR6_HIGH                   (PIO_DRIVER_DR6_HIGH_Val << PIO_DRIVER_DR6_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR7_Pos                    _U_(7)                                               /**< (PIO_DRIVER) Drive of I/O Line 7 Position */
#define PIO_DRIVER_DR7_Msk                    (_U_(0x1) << PIO_DRIVER_DR7_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 7 Mask */
#define PIO_DRIVER_DR7(value)                 (PIO_DRIVER_DR7_Msk & ((value) << PIO_DRIVER_DR7_Pos))
#define   PIO_DRIVER_DR7_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR7_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR7_LOW                    (PIO_DRIVER_DR7_LOW_Val << PIO_DRIVER_DR7_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR7_HIGH                   (PIO_DRIVER_DR7_HIGH_Val << PIO_DRIVER_DR7_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR8_Pos                    _U_(8)                                               /**< (PIO_DRIVER) Drive of I/O Line 8 Position */
#define PIO_DRIVER_DR8_Msk                    (_U_(0x1) << PIO_DRIVER_DR8_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 8 Mask */
#define PIO_DRIVER_DR8(value)                 (PIO_DRIVER_DR8_Msk & ((value) << PIO_DRIVER_DR8_Pos))
#define   PIO_DRIVER_DR8_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR8_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR8_LOW                    (PIO_DRIVER_DR8_LOW_Val << PIO_DRIVER_DR8_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR8_HIGH                   (PIO_DRIVER_DR8_HIGH_Val << PIO_DRIVER_DR8_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR9_Pos                    _U_(9)                                               /**< (PIO_DRIVER) Drive of I/O Line 9 Position */
#define PIO_DRIVER_DR9_Msk                    (_U_(0x1) << PIO_DRIVER_DR9_Pos)                     /**< (PIO_DRIVER) Drive of I/O Line 9 Mask */
#define PIO_DRIVER_DR9(value)                 (PIO_DRIVER_DR9_Msk & ((value) << PIO_DRIVER_DR9_Pos))
#define   PIO_DRIVER_DR9_LOW_Val              _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR9_HIGH_Val             _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR9_LOW                    (PIO_DRIVER_DR9_LOW_Val << PIO_DRIVER_DR9_Pos)       /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR9_HIGH                   (PIO_DRIVER_DR9_HIGH_Val << PIO_DRIVER_DR9_Pos)      /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR10_Pos                   _U_(10)                                              /**< (PIO_DRIVER) Drive of I/O Line 10 Position */
#define PIO_DRIVER_DR10_Msk                   (_U_(0x1) << PIO_DRIVER_DR10_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 10 Mask */
#define PIO_DRIVER_DR10(value)                (PIO_DRIVER_DR10_Msk & ((value) << PIO_DRIVER_DR10_Pos))
#define   PIO_DRIVER_DR10_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR10_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR10_LOW                   (PIO_DRIVER_DR10_LOW_Val << PIO_DRIVER_DR10_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR10_HIGH                  (PIO_DRIVER_DR10_HIGH_Val << PIO_DRIVER_DR10_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR11_Pos                   _U_(11)                                              /**< (PIO_DRIVER) Drive of I/O Line 11 Position */
#define PIO_DRIVER_DR11_Msk                   (_U_(0x1) << PIO_DRIVER_DR11_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 11 Mask */
#define PIO_DRIVER_DR11(value)                (PIO_DRIVER_DR11_Msk & ((value) << PIO_DRIVER_DR11_Pos))
#define   PIO_DRIVER_DR11_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR11_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR11_LOW                   (PIO_DRIVER_DR11_LOW_Val << PIO_DRIVER_DR11_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR11_HIGH                  (PIO_DRIVER_DR11_HIGH_Val << PIO_DRIVER_DR11_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR12_Pos                   _U_(12)                                              /**< (PIO_DRIVER) Drive of I/O Line 12 Position */
#define PIO_DRIVER_DR12_Msk                   (_U_(0x1) << PIO_DRIVER_DR12_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 12 Mask */
#define PIO_DRIVER_DR12(value)                (PIO_DRIVER_DR12_Msk & ((value) << PIO_DRIVER_DR12_Pos))
#define   PIO_DRIVER_DR12_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR12_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR12_LOW                   (PIO_DRIVER_DR12_LOW_Val << PIO_DRIVER_DR12_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR12_HIGH                  (PIO_DRIVER_DR12_HIGH_Val << PIO_DRIVER_DR12_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR13_Pos                   _U_(13)                                              /**< (PIO_DRIVER) Drive of I/O Line 13 Position */
#define PIO_DRIVER_DR13_Msk                   (_U_(0x1) << PIO_DRIVER_DR13_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 13 Mask */
#define PIO_DRIVER_DR13(value)                (PIO_DRIVER_DR13_Msk & ((value) << PIO_DRIVER_DR13_Pos))
#define   PIO_DRIVER_DR13_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR13_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR13_LOW                   (PIO_DRIVER_DR13_LOW_Val << PIO_DRIVER_DR13_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR13_HIGH                  (PIO_DRIVER_DR13_HIGH_Val << PIO_DRIVER_DR13_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR14_Pos                   _U_(14)                                              /**< (PIO_DRIVER) Drive of I/O Line 14 Position */
#define PIO_DRIVER_DR14_Msk                   (_U_(0x1) << PIO_DRIVER_DR14_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 14 Mask */
#define PIO_DRIVER_DR14(value)                (PIO_DRIVER_DR14_Msk & ((value) << PIO_DRIVER_DR14_Pos))
#define   PIO_DRIVER_DR14_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR14_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR14_LOW                   (PIO_DRIVER_DR14_LOW_Val << PIO_DRIVER_DR14_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR14_HIGH                  (PIO_DRIVER_DR14_HIGH_Val << PIO_DRIVER_DR14_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR15_Pos                   _U_(15)                                              /**< (PIO_DRIVER) Drive of I/O Line 15 Position */
#define PIO_DRIVER_DR15_Msk                   (_U_(0x1) << PIO_DRIVER_DR15_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 15 Mask */
#define PIO_DRIVER_DR15(value)                (PIO_DRIVER_DR15_Msk & ((value) << PIO_DRIVER_DR15_Pos))
#define   PIO_DRIVER_DR15_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR15_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR15_LOW                   (PIO_DRIVER_DR15_LOW_Val << PIO_DRIVER_DR15_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR15_HIGH                  (PIO_DRIVER_DR15_HIGH_Val << PIO_DRIVER_DR15_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR16_Pos                   _U_(16)                                              /**< (PIO_DRIVER) Drive of I/O Line 16 Position */
#define PIO_DRIVER_DR16_Msk                   (_U_(0x1) << PIO_DRIVER_DR16_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 16 Mask */
#define PIO_DRIVER_DR16(value)                (PIO_DRIVER_DR16_Msk & ((value) << PIO_DRIVER_DR16_Pos))
#define   PIO_DRIVER_DR16_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR16_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR16_LOW                   (PIO_DRIVER_DR16_LOW_Val << PIO_DRIVER_DR16_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR16_HIGH                  (PIO_DRIVER_DR16_HIGH_Val << PIO_DRIVER_DR16_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR17_Pos                   _U_(17)                                              /**< (PIO_DRIVER) Drive of I/O Line 17 Position */
#define PIO_DRIVER_DR17_Msk                   (_U_(0x1) << PIO_DRIVER_DR17_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 17 Mask */
#define PIO_DRIVER_DR17(value)                (PIO_DRIVER_DR17_Msk & ((value) << PIO_DRIVER_DR17_Pos))
#define   PIO_DRIVER_DR17_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR17_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR17_LOW                   (PIO_DRIVER_DR17_LOW_Val << PIO_DRIVER_DR17_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR17_HIGH                  (PIO_DRIVER_DR17_HIGH_Val << PIO_DRIVER_DR17_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR18_Pos                   _U_(18)                                              /**< (PIO_DRIVER) Drive of I/O Line 18 Position */
#define PIO_DRIVER_DR18_Msk                   (_U_(0x1) << PIO_DRIVER_DR18_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 18 Mask */
#define PIO_DRIVER_DR18(value)                (PIO_DRIVER_DR18_Msk & ((value) << PIO_DRIVER_DR18_Pos))
#define   PIO_DRIVER_DR18_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR18_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR18_LOW                   (PIO_DRIVER_DR18_LOW_Val << PIO_DRIVER_DR18_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR18_HIGH                  (PIO_DRIVER_DR18_HIGH_Val << PIO_DRIVER_DR18_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR19_Pos                   _U_(19)                                              /**< (PIO_DRIVER) Drive of I/O Line 19 Position */
#define PIO_DRIVER_DR19_Msk                   (_U_(0x1) << PIO_DRIVER_DR19_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 19 Mask */
#define PIO_DRIVER_DR19(value)                (PIO_DRIVER_DR19_Msk & ((value) << PIO_DRIVER_DR19_Pos))
#define   PIO_DRIVER_DR19_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR19_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR19_LOW                   (PIO_DRIVER_DR19_LOW_Val << PIO_DRIVER_DR19_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR19_HIGH                  (PIO_DRIVER_DR19_HIGH_Val << PIO_DRIVER_DR19_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR20_Pos                   _U_(20)                                              /**< (PIO_DRIVER) Drive of I/O Line 20 Position */
#define PIO_DRIVER_DR20_Msk                   (_U_(0x1) << PIO_DRIVER_DR20_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 20 Mask */
#define PIO_DRIVER_DR20(value)                (PIO_DRIVER_DR20_Msk & ((value) << PIO_DRIVER_DR20_Pos))
#define   PIO_DRIVER_DR20_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR20_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR20_LOW                   (PIO_DRIVER_DR20_LOW_Val << PIO_DRIVER_DR20_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR20_HIGH                  (PIO_DRIVER_DR20_HIGH_Val << PIO_DRIVER_DR20_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR21_Pos                   _U_(21)                                              /**< (PIO_DRIVER) Drive of I/O Line 21 Position */
#define PIO_DRIVER_DR21_Msk                   (_U_(0x1) << PIO_DRIVER_DR21_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 21 Mask */
#define PIO_DRIVER_DR21(value)                (PIO_DRIVER_DR21_Msk & ((value) << PIO_DRIVER_DR21_Pos))
#define   PIO_DRIVER_DR21_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR21_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR21_LOW                   (PIO_DRIVER_DR21_LOW_Val << PIO_DRIVER_DR21_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR21_HIGH                  (PIO_DRIVER_DR21_HIGH_Val << PIO_DRIVER_DR21_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR22_Pos                   _U_(22)                                              /**< (PIO_DRIVER) Drive of I/O Line 22 Position */
#define PIO_DRIVER_DR22_Msk                   (_U_(0x1) << PIO_DRIVER_DR22_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 22 Mask */
#define PIO_DRIVER_DR22(value)                (PIO_DRIVER_DR22_Msk & ((value) << PIO_DRIVER_DR22_Pos))
#define   PIO_DRIVER_DR22_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR22_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR22_LOW                   (PIO_DRIVER_DR22_LOW_Val << PIO_DRIVER_DR22_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR22_HIGH                  (PIO_DRIVER_DR22_HIGH_Val << PIO_DRIVER_DR22_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR23_Pos                   _U_(23)                                              /**< (PIO_DRIVER) Drive of I/O Line 23 Position */
#define PIO_DRIVER_DR23_Msk                   (_U_(0x1) << PIO_DRIVER_DR23_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 23 Mask */
#define PIO_DRIVER_DR23(value)                (PIO_DRIVER_DR23_Msk & ((value) << PIO_DRIVER_DR23_Pos))
#define   PIO_DRIVER_DR23_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR23_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR23_LOW                   (PIO_DRIVER_DR23_LOW_Val << PIO_DRIVER_DR23_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR23_HIGH                  (PIO_DRIVER_DR23_HIGH_Val << PIO_DRIVER_DR23_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR24_Pos                   _U_(24)                                              /**< (PIO_DRIVER) Drive of I/O Line 24 Position */
#define PIO_DRIVER_DR24_Msk                   (_U_(0x1) << PIO_DRIVER_DR24_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 24 Mask */
#define PIO_DRIVER_DR24(value)                (PIO_DRIVER_DR24_Msk & ((value) << PIO_DRIVER_DR24_Pos))
#define   PIO_DRIVER_DR24_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR24_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR24_LOW                   (PIO_DRIVER_DR24_LOW_Val << PIO_DRIVER_DR24_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
