Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pio.h
#define PIO_DRIVER_DR24_HIGH                  (PIO_DRIVER_DR24_HIGH_Val << PIO_DRIVER_DR24_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR25_Pos                   _U_(25)                                              /**< (PIO_DRIVER) Drive of I/O Line 25 Position */
#define PIO_DRIVER_DR25_Msk                   (_U_(0x1) << PIO_DRIVER_DR25_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 25 Mask */
#define PIO_DRIVER_DR25(value)                (PIO_DRIVER_DR25_Msk & ((value) << PIO_DRIVER_DR25_Pos))
#define   PIO_DRIVER_DR25_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR25_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR25_LOW                   (PIO_DRIVER_DR25_LOW_Val << PIO_DRIVER_DR25_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR25_HIGH                  (PIO_DRIVER_DR25_HIGH_Val << PIO_DRIVER_DR25_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR26_Pos                   _U_(26)                                              /**< (PIO_DRIVER) Drive of I/O Line 26 Position */
#define PIO_DRIVER_DR26_Msk                   (_U_(0x1) << PIO_DRIVER_DR26_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 26 Mask */
#define PIO_DRIVER_DR26(value)                (PIO_DRIVER_DR26_Msk & ((value) << PIO_DRIVER_DR26_Pos))
#define   PIO_DRIVER_DR26_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR26_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR26_LOW                   (PIO_DRIVER_DR26_LOW_Val << PIO_DRIVER_DR26_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR26_HIGH                  (PIO_DRIVER_DR26_HIGH_Val << PIO_DRIVER_DR26_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR27_Pos                   _U_(27)                                              /**< (PIO_DRIVER) Drive of I/O Line 27 Position */
#define PIO_DRIVER_DR27_Msk                   (_U_(0x1) << PIO_DRIVER_DR27_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 27 Mask */
#define PIO_DRIVER_DR27(value)                (PIO_DRIVER_DR27_Msk & ((value) << PIO_DRIVER_DR27_Pos))
#define   PIO_DRIVER_DR27_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR27_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR27_LOW                   (PIO_DRIVER_DR27_LOW_Val << PIO_DRIVER_DR27_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR27_HIGH                  (PIO_DRIVER_DR27_HIGH_Val << PIO_DRIVER_DR27_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR28_Pos                   _U_(28)                                              /**< (PIO_DRIVER) Drive of I/O Line 28 Position */
#define PIO_DRIVER_DR28_Msk                   (_U_(0x1) << PIO_DRIVER_DR28_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 28 Mask */
#define PIO_DRIVER_DR28(value)                (PIO_DRIVER_DR28_Msk & ((value) << PIO_DRIVER_DR28_Pos))
#define   PIO_DRIVER_DR28_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR28_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR28_LOW                   (PIO_DRIVER_DR28_LOW_Val << PIO_DRIVER_DR28_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR28_HIGH                  (PIO_DRIVER_DR28_HIGH_Val << PIO_DRIVER_DR28_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR29_Pos                   _U_(29)                                              /**< (PIO_DRIVER) Drive of I/O Line 29 Position */
#define PIO_DRIVER_DR29_Msk                   (_U_(0x1) << PIO_DRIVER_DR29_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 29 Mask */
#define PIO_DRIVER_DR29(value)                (PIO_DRIVER_DR29_Msk & ((value) << PIO_DRIVER_DR29_Pos))
#define   PIO_DRIVER_DR29_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR29_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR29_LOW                   (PIO_DRIVER_DR29_LOW_Val << PIO_DRIVER_DR29_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR29_HIGH                  (PIO_DRIVER_DR29_HIGH_Val << PIO_DRIVER_DR29_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR30_Pos                   _U_(30)                                              /**< (PIO_DRIVER) Drive of I/O Line 30 Position */
#define PIO_DRIVER_DR30_Msk                   (_U_(0x1) << PIO_DRIVER_DR30_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 30 Mask */
#define PIO_DRIVER_DR30(value)                (PIO_DRIVER_DR30_Msk & ((value) << PIO_DRIVER_DR30_Pos))
#define   PIO_DRIVER_DR30_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR30_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR30_LOW                   (PIO_DRIVER_DR30_LOW_Val << PIO_DRIVER_DR30_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR30_HIGH                  (PIO_DRIVER_DR30_HIGH_Val << PIO_DRIVER_DR30_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_DR31_Pos                   _U_(31)                                              /**< (PIO_DRIVER) Drive of I/O Line 31 Position */
#define PIO_DRIVER_DR31_Msk                   (_U_(0x1) << PIO_DRIVER_DR31_Pos)                    /**< (PIO_DRIVER) Drive of I/O Line 31 Mask */
#define PIO_DRIVER_DR31(value)                (PIO_DRIVER_DR31_Msk & ((value) << PIO_DRIVER_DR31_Pos))
#define   PIO_DRIVER_DR31_LOW_Val             _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_DR31_HIGH_Val            _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_DR31_LOW                   (PIO_DRIVER_DR31_LOW_Val << PIO_DRIVER_DR31_Pos)     /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_DR31_HIGH                  (PIO_DRIVER_DR31_HIGH_Val << PIO_DRIVER_DR31_Pos)    /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_Msk                        _U_(0xFFFFFFFF)                                      /**< (PIO_DRIVER) Register Mask  */

#define PIO_DRIVER_DR_Pos                     _U_(0)                                               /**< (PIO_DRIVER Position) Drive of I/O Line 3x */
#define PIO_DRIVER_DR_Msk                     (_U_(0xFFFFFFFF) << PIO_DRIVER_DR_Pos)               /**< (PIO_DRIVER Mask) DR */
#define PIO_DRIVER_DR(value)                  (PIO_DRIVER_DR_Msk & ((value) << PIO_DRIVER_DR_Pos)) 

/** \brief PIO register offsets definitions */
#define PIO_PER_REG_OFST               (0x00)              /**< (PIO_PER) PIO Enable Register Offset */
#define PIO_PDR_REG_OFST               (0x04)              /**< (PIO_PDR) PIO Disable Register Offset */
#define PIO_PSR_REG_OFST               (0x08)              /**< (PIO_PSR) PIO Status Register Offset */
#define PIO_OER_REG_OFST               (0x10)              /**< (PIO_OER) Output Enable Register Offset */
#define PIO_ODR_REG_OFST               (0x14)              /**< (PIO_ODR) Output Disable Register Offset */
#define PIO_OSR_REG_OFST               (0x18)              /**< (PIO_OSR) Output Status Register Offset */
#define PIO_IFER_REG_OFST              (0x20)              /**< (PIO_IFER) Glitch Input Filter Enable Register Offset */
#define PIO_IFDR_REG_OFST              (0x24)              /**< (PIO_IFDR) Glitch Input Filter Disable Register Offset */
#define PIO_IFSR_REG_OFST              (0x28)              /**< (PIO_IFSR) Glitch Input Filter Status Register Offset */
#define PIO_SODR_REG_OFST              (0x30)              /**< (PIO_SODR) Set Output Data Register Offset */
#define PIO_CODR_REG_OFST              (0x34)              /**< (PIO_CODR) Clear Output Data Register Offset */
#define PIO_ODSR_REG_OFST              (0x38)              /**< (PIO_ODSR) Output Data Status Register Offset */
#define PIO_PDSR_REG_OFST              (0x3C)              /**< (PIO_PDSR) Pin Data Status Register Offset */
#define PIO_IER_REG_OFST               (0x40)              /**< (PIO_IER) Interrupt Enable Register Offset */
#define PIO_IDR_REG_OFST               (0x44)              /**< (PIO_IDR) Interrupt Disable Register Offset */
#define PIO_IMR_REG_OFST               (0x48)              /**< (PIO_IMR) Interrupt Mask Register Offset */
#define PIO_ISR_REG_OFST               (0x4C)              /**< (PIO_ISR) Interrupt Status Register Offset */
#define PIO_MDER_REG_OFST              (0x50)              /**< (PIO_MDER) Multi-driver Enable Register Offset */
#define PIO_MDDR_REG_OFST              (0x54)              /**< (PIO_MDDR) Multi-driver Disable Register Offset */
#define PIO_MDSR_REG_OFST              (0x58)              /**< (PIO_MDSR) Multi-driver Status Register Offset */
#define PIO_PUDR_REG_OFST              (0x60)              /**< (PIO_PUDR) Pull-Up Disable Register Offset */
#define PIO_PUER_REG_OFST              (0x64)              /**< (PIO_PUER) Pull-Up Enable Register Offset */
#define PIO_PUSR_REG_OFST              (0x68)              /**< (PIO_PUSR) Pad Pull-Up Status Register Offset */
#define PIO_ABCDSR_REG_OFST            (0x70)              /**< (PIO_ABCDSR) Peripheral ABCD Select Register Offset */
#define PIO_IFSCDR_REG_OFST            (0x80)              /**< (PIO_IFSCDR) Input Filter Slow Clock Disable Register Offset */
#define PIO_IFSCER_REG_OFST            (0x84)              /**< (PIO_IFSCER) Input Filter Slow Clock Enable Register Offset */
#define PIO_IFSCSR_REG_OFST            (0x88)              /**< (PIO_IFSCSR) Input Filter Slow Clock Status Register Offset */
#define PIO_SCDR_REG_OFST              (0x8C)              /**< (PIO_SCDR) Slow Clock Divider Debouncing Register Offset */
#define PIO_PPDDR_REG_OFST             (0x90)              /**< (PIO_PPDDR) Pad Pull-Down Disable Register Offset */
#define PIO_PPDER_REG_OFST             (0x94)              /**< (PIO_PPDER) Pad Pull-Down Enable Register Offset */
#define PIO_PPDSR_REG_OFST             (0x98)              /**< (PIO_PPDSR) Pad Pull-Down Status Register Offset */
#define PIO_OWER_REG_OFST              (0xA0)              /**< (PIO_OWER) Output Write Enable Offset */
#define PIO_OWDR_REG_OFST              (0xA4)              /**< (PIO_OWDR) Output Write Disable Offset */
#define PIO_OWSR_REG_OFST              (0xA8)              /**< (PIO_OWSR) Output Write Status Register Offset */
#define PIO_AIMER_REG_OFST             (0xB0)              /**< (PIO_AIMER) Additional Interrupt Modes Enable Register Offset */
#define PIO_AIMDR_REG_OFST             (0xB4)              /**< (PIO_AIMDR) Additional Interrupt Modes Disable Register Offset */
#define PIO_AIMMR_REG_OFST             (0xB8)              /**< (PIO_AIMMR) Additional Interrupt Modes Mask Register Offset */
#define PIO_ESR_REG_OFST               (0xC0)              /**< (PIO_ESR) Edge Select Register Offset */
#define PIO_LSR_REG_OFST               (0xC4)              /**< (PIO_LSR) Level Select Register Offset */
#define PIO_ELSR_REG_OFST              (0xC8)              /**< (PIO_ELSR) Edge/Level Status Register Offset */
#define PIO_FELLSR_REG_OFST            (0xD0)              /**< (PIO_FELLSR) Falling Edge/Low-Level Select Register Offset */
#define PIO_REHLSR_REG_OFST            (0xD4)              /**< (PIO_REHLSR) Rising Edge/High-Level Select Register Offset */
#define PIO_FRLHSR_REG_OFST            (0xD8)              /**< (PIO_FRLHSR) Fall/Rise - Low/High Status Register Offset */
#define PIO_WPMR_REG_OFST              (0xE4)              /**< (PIO_WPMR) Write Protection Mode Register Offset */
#define PIO_WPSR_REG_OFST              (0xE8)              /**< (PIO_WPSR) Write Protection Status Register Offset */
#define PIO_VERSION_REG_OFST           (0xFC)              /**< (PIO_VERSION) Version Register Offset */
#define PIO_SCHMITT_REG_OFST           (0x100)             /**< (PIO_SCHMITT) Schmitt Trigger Register Offset */
#define PIO_SLEWR_REG_OFST             (0x110)             /**< (PIO_SLEWR) I/O Slewrate Control Register Offset */
#define PIO_DRIVER_REG_OFST            (0x118)             /**< (PIO_DRIVER) I/O Drive Register Offset */

