Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pio.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PIO register API structure */
typedef struct
{
  __O   uint32_t                       PIO_PER;            /**< Offset: 0x00 ( /W  32) PIO Enable Register */
  __O   uint32_t                       PIO_PDR;            /**< Offset: 0x04 ( /W  32) PIO Disable Register */
  __I   uint32_t                       PIO_PSR;            /**< Offset: 0x08 (R/   32) PIO Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PIO_OER;            /**< Offset: 0x10 ( /W  32) Output Enable Register */
  __O   uint32_t                       PIO_ODR;            /**< Offset: 0x14 ( /W  32) Output Disable Register */
  __I   uint32_t                       PIO_OSR;            /**< Offset: 0x18 (R/   32) Output Status Register */
  __I   uint8_t                        Reserved2[0x04];
  __O   uint32_t                       PIO_IFER;           /**< Offset: 0x20 ( /W  32) Glitch Input Filter Enable Register */
  __O   uint32_t                       PIO_IFDR;           /**< Offset: 0x24 ( /W  32) Glitch Input Filter Disable Register */
  __I   uint32_t                       PIO_IFSR;           /**< Offset: 0x28 (R/   32) Glitch Input Filter Status Register */
  __I   uint8_t                        Reserved3[0x04];
  __O   uint32_t                       PIO_SODR;           /**< Offset: 0x30 ( /W  32) Set Output Data Register */
  __O   uint32_t                       PIO_CODR;           /**< Offset: 0x34 ( /W  32) Clear Output Data Register */
  __IO  uint32_t                       PIO_ODSR;           /**< Offset: 0x38 (R/W  32) Output Data Status Register */
  __I   uint32_t                       PIO_PDSR;           /**< Offset: 0x3C (R/   32) Pin Data Status Register */
  __O   uint32_t                       PIO_IER;            /**< Offset: 0x40 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       PIO_IDR;            /**< Offset: 0x44 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       PIO_IMR;            /**< Offset: 0x48 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       PIO_ISR;            /**< Offset: 0x4C (R/   32) Interrupt Status Register */
  __O   uint32_t                       PIO_MDER;           /**< Offset: 0x50 ( /W  32) Multi-driver Enable Register */
  __O   uint32_t                       PIO_MDDR;           /**< Offset: 0x54 ( /W  32) Multi-driver Disable Register */
  __I   uint32_t                       PIO_MDSR;           /**< Offset: 0x58 (R/   32) Multi-driver Status Register */
  __I   uint8_t                        Reserved4[0x04];
  __O   uint32_t                       PIO_PUDR;           /**< Offset: 0x60 ( /W  32) Pull-Up Disable Register */
  __O   uint32_t                       PIO_PUER;           /**< Offset: 0x64 ( /W  32) Pull-Up Enable Register */
  __I   uint32_t                       PIO_PUSR;           /**< Offset: 0x68 (R/   32) Pad Pull-Up Status Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       PIO_ABCDSR[2];      /**< Offset: 0x70 (R/W  32) Peripheral ABCD Select Register */
  __I   uint8_t                        Reserved6[0x08];
  __O   uint32_t                       PIO_IFSCDR;         /**< Offset: 0x80 ( /W  32) Input Filter Slow Clock Disable Register */
  __O   uint32_t                       PIO_IFSCER;         /**< Offset: 0x84 ( /W  32) Input Filter Slow Clock Enable Register */
  __I   uint32_t                       PIO_IFSCSR;         /**< Offset: 0x88 (R/   32) Input Filter Slow Clock Status Register */
  __IO  uint32_t                       PIO_SCDR;           /**< Offset: 0x8C (R/W  32) Slow Clock Divider Debouncing Register */
  __O   uint32_t                       PIO_PPDDR;          /**< Offset: 0x90 ( /W  32) Pad Pull-Down Disable Register */
  __O   uint32_t                       PIO_PPDER;          /**< Offset: 0x94 ( /W  32) Pad Pull-Down Enable Register */
  __I   uint32_t                       PIO_PPDSR;          /**< Offset: 0x98 (R/   32) Pad Pull-Down Status Register */
  __I   uint8_t                        Reserved7[0x04];
  __O   uint32_t                       PIO_OWER;           /**< Offset: 0xA0 ( /W  32) Output Write Enable */
  __O   uint32_t                       PIO_OWDR;           /**< Offset: 0xA4 ( /W  32) Output Write Disable */
  __I   uint32_t                       PIO_OWSR;           /**< Offset: 0xA8 (R/   32) Output Write Status Register */
  __I   uint8_t                        Reserved8[0x04];
  __O   uint32_t                       PIO_AIMER;          /**< Offset: 0xB0 ( /W  32) Additional Interrupt Modes Enable Register */
  __O   uint32_t                       PIO_AIMDR;          /**< Offset: 0xB4 ( /W  32) Additional Interrupt Modes Disable Register */
  __I   uint32_t                       PIO_AIMMR;          /**< Offset: 0xB8 (R/   32) Additional Interrupt Modes Mask Register */
  __I   uint8_t                        Reserved9[0x04];
  __O   uint32_t                       PIO_ESR;            /**< Offset: 0xC0 ( /W  32) Edge Select Register */
  __O   uint32_t                       PIO_LSR;            /**< Offset: 0xC4 ( /W  32) Level Select Register */
  __I   uint32_t                       PIO_ELSR;           /**< Offset: 0xC8 (R/   32) Edge/Level Status Register */
  __I   uint8_t                        Reserved10[0x04];
  __O   uint32_t                       PIO_FELLSR;         /**< Offset: 0xD0 ( /W  32) Falling Edge/Low-Level Select Register */
  __O   uint32_t                       PIO_REHLSR;         /**< Offset: 0xD4 ( /W  32) Rising Edge/High-Level Select Register */
  __I   uint32_t                       PIO_FRLHSR;         /**< Offset: 0xD8 (R/   32) Fall/Rise - Low/High Status Register */
  __I   uint8_t                        Reserved11[0x08];
  __IO  uint32_t                       PIO_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       PIO_WPSR;           /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved12[0x10];
  __I   uint32_t                       PIO_VERSION;        /**< Offset: 0xFC (R/   32) Version Register */
  __IO  uint32_t                       PIO_SCHMITT;        /**< Offset: 0x100 (R/W  32) Schmitt Trigger Register */
  __I   uint8_t                        Reserved13[0x0C];
  __IO  uint32_t                       PIO_SLEWR;          /**< Offset: 0x110 (R/W  32) I/O Slewrate Control Register */
  __I   uint8_t                        Reserved14[0x04];
  __IO  uint32_t                       PIO_DRIVER;         /**< Offset: 0x118 (R/W  32) I/O Drive Register */
} pio_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_PIO_COMPONENT_H_ */
